package com.example.qlexpressdemo;

import com.ql.util.express.DefaultContext;
import com.ql.util.express.ExpressRunner;
import com.ql.util.express.IExpressContext;
import com.ql.util.express.Operator;

import java.util.Arrays;
import java.util.HashMap;
import java.util.stream.Stream;

/**
 * @Description
 * @Author wangshuo
 * @Date 2022-06-24 10:24
 * @Version V1.0
 */
public class demo {

    public static void main(String[] args) throws Exception {
        ExpressRunner runner = new ExpressRunner();
//        getStarted(runner);

//        basicStatement(runner);

//        collectionStatement(runner);

//        objectStatement(runner);

//        functionStatement(runner);

//        macronStatement(runner);

//        workWithJavaStatement(runner);

//        extendOperatorStatement(runner);

//        customOperatorStatement(runner);

//        System.err.println("请求总结并报告本周白糖行情☺".replaceAll(
//            "[\\x{1F600}-\\x{1F64F}\\x{1F300}-\\x{1F5FF}\\x{1F680}-\\x{1F6FF}\\x{1F700}-\\x{1F77F}\\x{1F780}-\\x{1F7FF}\\x{1F800}-\\x{1F8FF}\\x{1F900}-\\x{1F9FF}\\x{1FA00}-\\x{1FA6F}\\x{1FA70"
//                + "}-\\x{1FAFF}\\x{2600}-\\x{26FF}\\x{2700}-\\x{27BF}\\x{2300}-\\x{23FF}\\x{2B50}\\x{203C}\\x{2049}\\x{25AA}\\x{25AB}\\x{25FE}\\x{2B06}\\x{2194}\\x{21A9}\\x{21AA}\\x{2934}\\x"
//                + "{2935}\\x{2B05}\\x{2B06}\\x{2194}\\x{2B50}]",
//            ""));
//
////农业日报20250511
//
//
//        System.err.println( "农业日报20250511".length());
//        System.err.println( Stream.of("日报", "周报","月报", "报告").anyMatch("农业日报20250511"::contains));

        String xml = "<item><name>全国农产品批发市场价格信息系统价格数据-大豆新疆维吾尔自治区博尔塔拉蒙古自治州新疆兵团第五师三和农副产品综合批发市场最低价</name><units>元/公斤</units><source>农业农村部、布瑞克农业大数据</source><data>[\\\"20250516 8\\\",\\\"20250515 8\\\","
            + "\\\"20250514 8\\\",\\\"20250513 8\\\",\\\"20250512 8\\\",\\\"20250509 8\\\",\\\"20250508 8\\\",\\\"20250507 8\\\",\\\"20250506 8\\\",\\\"20250501 8\\\",\\\"20250429 8\\\","
            + "\\\"20250428 8\\\",\\\"20250425 8\\\",\\\"20250424 8\\\",\\\"20250423 8\\\",\\\"20250422 8\\\",\\\"20250421 8\\\",\\\"20250418 8\\\",\\\"20250417 8\\\",\\\"20250416 8\\\","
            + "\\\"20250415 8\\\",\\\"20250414 8\\\",\\\"20250409 8\\\",\\\"20250408 8\\\",\\\"20250407 8\\\",\\\"20250402 8\\\",\\\"20250401 "
            + "8\\\"]</data></item>\\n<item><name>全国农产品批发市场价格信息系统价格数据-大豆江苏省常州市江苏凌家塘市场发展有限公司最高价</name><units>元/公斤</units><source>农业农村部、布瑞克农业大数据</source><data>[\\\"20250516 8\\\",\\\"20250515 8\\\","
            + "\\\"20250514 8\\\",\\\"20250513 8\\\",\\\"20250512 8\\\",\\\"20250509 8\\\",\\\"20250508 8\\\",\\\"20250507 8\\\",\\\"20250506 8\\\",\\\"20250501 8\\\",\\\"20250429 8\\\","
            + "\\\"20250428 8\\\",\\\"20250425 8\\\",\\\"20250424 8\\\",\\\"20250423 8\\\",\\\"20250422 8\\\",\\\"20250421 8\\\",\\\"20250418 8\\\",\\\"20250417 8\\\",\\\"20250416 8\\\","
            + "\\\"20250415 8\\\",\\\"20250414 8\\\",\\\"20250409 8\\\",\\\"20250408 8\\\",\\\"20250407 8\\\",\\\"20250402 8\\\",\\\"20250401 8\\\",\\\"20250518 7\\\",\\\"20250517 7\\\","
            + "\\\"20250516 7\\\",\\\"20250515 7\\\",\\\"20250514 7\\\",\\\"20250513 7\\\",\\\"20250512 7\\\",\\\"20250511 7\\\",\\\"20250510 7\\\",\\\"20250509 7\\\",\\\"20250508 7\\\","
            + "\\\"20250507 7\\\",\\\"20250506 7\\\",\\\"20250505 7\\\",\\\"20250504 7\\\",\\\"20250503 7\\\",\\\"20250502 7\\\",\\\"20250501 7\\\",\\\"20250430 7\\\",\\\"20250429 7\\\","
            + "\\\"20250428 7\\\",\\\"20250427 7\\\",\\\"20250426 7\\\",\\\"20250425 7\\\",\\\"20250424 7\\\",\\\"20250423 7\\\",\\\"20250422 6.9\\\",\\\"20250421 6.9\\\",\\\"20250420 6.9\\\","
            + "\\\"20250419 6.9\\\",\\\"20250418 6.9\\\",\\\"20250417 6.9\\\",\\\"20250416 6.9\\\",\\\"20250415 6.9\\\",\\\"20250414 6.9\\\",\\\"20250413 6.9\\\",\\\"20250412 6.9\\\",\\\"20250411 6"
            + ".9\\\",\\\"20250409 6.8\\\",\\\"20250408 6.8\\\",\\\"20250407 6.8\\\",\\\"20250406 6.8\\\",\\\"20250405 6.8\\\",\\\"20250403 6.8\\\",\\\"20250402 6.8\\\",\\\"20250401 6"
            + ".8\\\"]</data></item>\\n<item><name>全国农产品批发市场价格信息系统价格数据-大豆吉林省松原市扶余市三井子园区市场建设运营有限公司中间价</name><units>元/公斤</units><source>农业农村部、布瑞克农业大数据</source><data>[\\\"20250516 8\\\",\\\"20250515 "
            + "8\\\",\\\"20250514 8\\\",\\\"20250513 8\\\",\\\"20250512 8\\\",\\\"20250509 8\\\",\\\"20250508 8\\\",\\\"20250507 8\\\",\\\"20250506 8\\\",\\\"20250501 8\\\",\\\"20250429 8\\\","
            + "\\\"20250428 8\\\",\\\"20250425 8\\\",\\\"20250424 8\\\",\\\"20250423 8\\\",\\\"20250422 8\\\",\\\"20250421 8\\\",\\\"20250418 8\\\",\\\"20250417 8\\\",\\\"20250416 8\\\","
            + "\\\"20250415 8\\\",\\\"20250414 8\\\",\\\"20250409 8\\\",\\\"20250408 8\\\",\\\"20250407 8\\\",\\\"20250402 8\\\",\\\"20250401 8\\\",\\\"20250518 7\\\",\\\"20250517 7\\\","
            + "\\\"20250516 7\\\",\\\"20250515 7\\\",\\\"20250514 7\\\",\\\"20250513 7\\\",\\\"20250512 7\\\",\\\"20250511 7\\\",\\\"20250510 7\\\",\\\"20250509 7\\\",\\\"20250508 7\\\","
            + "\\\"20250507 7\\\",\\\"20250506 7\\\",\\\"20250505 7\\\",\\\"20250504 7\\\",\\\"20250503 7\\\",\\\"20250502 7\\\",\\\"20250501 7\\\",\\\"20250430 7\\\",\\\"20250429 7\\\","
            + "\\\"20250428 7\\\",\\\"20250427 7\\\",\\\"20250426 7\\\",\\\"20250425 7\\\",\\\"20250424 7\\\",\\\"20250423 7\\\",\\\"20250422 6.9\\\",\\\"20250421 6.9\\\",\\\"20250420 6.9\\\","
            + "\\\"20250419 6.9\\\",\\\"20250418 6.9\\\",\\\"20250417 6.9\\\",\\\"20250416 6.9\\\",\\\"20250415 6.9\\\",\\\"20250414 6.9\\\",\\\"20250413 6.9\\\",\\\"20250412 6.9\\\",\\\"20250411 6"
            + ".9\\\",\\\"20250409 6.8\\\",\\\"20250408 6.8\\\",\\\"20250407 6.8\\\",\\\"20250406 6.8\\\",\\\"20250405 6.8\\\",\\\"20250403 6.8\\\",\\\"20250402 6.8\\\",\\\"20250401 6.8\\\","
            + "\\\"20250516 3.6\\\",\\\"20250515 3.6\\\",\\\"20250514 4\\\",\\\"20250513 4\\\",\\\"20250512 4\\\",\\\"20250511 4\\\",\\\"20250510 4\\\",\\\"20250509 4\\\",\\\"20250508 4\\\","
            + "\\\"20250507 4\\\",\\\"20250506 4\\\",\\\"20250505 4\\\",\\\"20250504 4\\\",\\\"20250503 4\\\",\\\"20250502 4\\\",\\\"20250501 4\\\",\\\"20250430 4\\\",\\\"20250429 4\\\","
            + "\\\"20250428 4\\\",\\\"20250427 4\\\",\\\"20250426 4\\\",\\\"20250425 4\\\",\\\"20250424 4\\\",\\\"20250423 4\\\",\\\"20250422 4\\\",\\\"20250421 4\\\",\\\"20250420 4\\\","
            + "\\\"20250419 4\\\",\\\"20250418 4\\\",\\\"20250417 4\\\",\\\"20250416 4\\\",\\\"20250415 4\\\",\\\"20250414 4\\\",\\\"20250413 4\\\",\\\"20250412 4\\\",\\\"20250411 4\\\","
            + "\\\"20250409 4\\\",\\\"20250408 4\\\",\\\"20250407 4\\\",\\\"20250405 4\\\",\\\"20250403 4\\\",\\\"20250402 4\\\",\\\"20250401 "
            + "4\\\"]</data></item>\\n<item><name>全国农产品批发市场价格信息系统价格数据-大豆新疆维吾尔自治区乌鲁木齐市乌鲁木齐北园春果业经营管理有限责任公司中间价</name><units>元/公斤</units><source>农业农村部、布瑞克农业大数据</source><data>[\\\"20250516 8\\\","
            + "\\\"20250515 8\\\",\\\"20250514 8\\\",\\\"20250513 8\\\",\\\"20250512 8\\\",\\\"20250509 8\\\",\\\"20250508 8\\\",\\\"20250507 8\\\",\\\"20250506 8\\\",\\\"20250501 8\\\","
            + "\\\"20250429 8\\\",\\\"20250428 8\\\",\\\"20250425 8\\\",\\\"20250424 8\\\",\\\"20250423 8\\\",\\\"20250422 8\\\",\\\"20250421 8\\\",\\\"20250418 8\\\",\\\"20250417 8\\\","
            + "\\\"20250416 8\\\",\\\"20250415 8\\\",\\\"20250414 8\\\",\\\"20250409 8\\\",\\\"20250408 8\\\",\\\"20250407 8\\\",\\\"20250402 8\\\",\\\"20250401 8\\\",\\\"20250518 7\\\","
            + "\\\"20250517 7\\\",\\\"20250516 7\\\",\\\"20250515 7\\\",\\\"20250514 7\\\",\\\"20250513 7\\\",\\\"20250512 7\\\",\\\"20250511 7\\\",\\\"20250510 7\\\",\\\"20250509 7\\\","
            + "\\\"20250508 7\\\",\\\"20250507 7\\\",\\\"20250506 7\\\",\\\"20250505 7\\\",\\\"20250504 7\\\",\\\"20250503 7\\\",\\\"20250502 7\\\",\\\"20250501 7\\\",\\\"20250430 7\\\","
            + "\\\"20250429 7\\\",\\\"20250428 7\\\",\\\"20250427 7\\\",\\\"20250426 7\\\",\\\"20250425 7\\\",\\\"20250424 7\\\",\\\"20250423 7\\\",\\\"20250422 6.9\\\",\\\"20250421 6.9\\\","
            + "\\\"20250420 6.9\\\",\\\"20250419 6.9\\\",\\\"20250418 6.9\\\",\\\"20250417 6.9\\\",\\\"20250416 6.9\\\",\\\"20250415 6.9\\\",\\\"20250414 6.9\\\",\\\"20250413 6.9\\\",\\\"20250412 6"
            + ".9\\\",\\\"20250411 6.9\\\",\\\"20250409 6.8\\\",\\\"20250408 6.8\\\",\\\"20250407 6.8\\\",\\\"20250406 6.8\\\",\\\"20250405 6.8\\\",\\\"20250403 6.8\\\",\\\"20250402 6.8\\\","
            + "\\\"20250401 6.8\\\",\\\"20250516 3.6\\\",\\\"20250515 3.6\\\",\\\"20250514 4\\\",\\\"20250513 4\\\",\\\"20250512 4\\\",\\\"20250511 4\\\",\\\"20250510 4\\\",\\\"20250509 4\\\","
            + "\\\"20250508 4\\\",\\\"20250507 4\\\",\\\"20250506 4\\\",\\\"20250505 4\\\",\\\"20250504 4\\\",\\\"20250503 4\\\",\\\"20250502 4\\\",\\\"20250501 4\\\",\\\"20250430 4\\\","
            + "\\\"20250429 4\\\",\\\"20250428 4\\\",\\\"20250427 4\\\",\\\"20250426 4\\\",\\\"20250425 4\\\",\\\"20250424 4\\\",\\\"20250423 4\\\",\\\"20250422 4\\\",\\\"20250421 4\\\","
            + "\\\"20250420 4\\\",\\\"20250419 4\\\",\\\"20250418 4\\\",\\\"20250417 4\\\",\\\"20250416 4\\\",\\\"20250415 4\\\",\\\"20250414 4\\\",\\\"20250413 4\\\",\\\"20250412 4\\\","
            + "\\\"20250411 4\\\",\\\"20250409 4\\\",\\\"20250408 4\\\",\\\"20250407 4\\\",\\\"20250405 4\\\",\\\"20250403 4\\\",\\\"20250402 4\\\",\\\"20250401 4\\\",\\\"20250518 9.3\\\","
            + "\\\"20250517 9.3\\\",\\\"20250516 9.3\\\",\\\"20250515 9.3\\\",\\\"20250514 9.3\\\",\\\"20250513 9.3\\\",\\\"20250512 9.3\\\",\\\"20250511 9.3\\\",\\\"20250510 9.3\\\",\\\"20250509 9"
            + ".3\\\",\\\"20250508 9.3\\\",\\\"20250507 9.3\\\",\\\"20250506 9.3\\\",\\\"20250505 9.3\\\",\\\"20250504 9.3\\\",\\\"20250503 9.3\\\",\\\"20250502 9.3\\\",\\\"20250501 9.3\\\","
            + "\\\"20250430 9.3\\\",\\\"20250429 9.3\\\",\\\"20250428 9.3\\\",\\\"20250427 9.3\\\",\\\"20250426 9.3\\\",\\\"20250425 9.3\\\",\\\"20250424 9.3\\\",\\\"20250423 9.3\\\",\\\"20250422 9"
            + ".3\\\",\\\"20250421 9.3\\\",\\\"20250420 9.3\\\",\\\"20250419 9.3\\\",\\\"20250418 9.3\\\",\\\"20250417 9.3\\\",\\\"20250416 9.3\\\",\\\"20250415 9.3\\\",\\\"20250414 9.3\\\","
            + "\\\"20250413 9.3\\\",\\\"20250412 9.3\\\",\\\"20250411 9.3\\\",\\\"20250409 9.3\\\",\\\"20250408 9.3\\\",\\\"20250407 9.3\\\",\\\"20250406 9.3\\\",\\\"20250405 9.3\\\",\\\"20250404 9"
            + ".3\\\",\\\"20250403 9.3\\\",\\\"20250402 9.3\\\",\\\"20250401 9.3\\\"]</data></item>\\n<item><name>全国农产品批发市场价格信息系统价格数据-大豆新疆维吾尔自治区巴音郭楞蒙古自治州新疆焉耆县光明农副产品综合批发市场最低价</name><units"
            + ">元/公斤</units><source>农业农村部、布瑞克农业大数据</source><data>[\\\"20250516 8\\\",\\\"20250515 8\\\",\\\"20250514 8\\\",\\\"20250513 8\\\",\\\"20250512 8\\\",\\\"20250509 8\\\",\\\"20250508 "
            + "8\\\",\\\"20250507 8\\\",\\\"20250506 8\\\",\\\"20250501 8\\\",\\\"20250429 8\\\",\\\"20250428 8\\\",\\\"20250425 8\\\",\\\"20250424 8\\\",\\\"20250423 8\\\",\\\"20250422 8\\\","
            + "\\\"20250421 8\\\",\\\"20250418 8\\\",\\\"20250417 8\\\",\\\"20250416 8\\\",\\\"20250415 8\\\",\\\"20250414 8\\\",\\\"20250409 8\\\",\\\"20250408 8\\\",\\\"20250407 8\\\","
            + "\\\"20250402 8\\\",\\\"20250401 8\\\",\\\"20250518 7\\\",\\\"20250517 7\\\",\\\"20250516 7\\\",\\\"20250515 7\\\",\\\"20250514 7\\\",\\\"20250513 7\\\",\\\"20250512 7\\\","
            + "\\\"20250511 7\\\",\\\"20250510 7\\\",\\\"20250509 7\\\",\\\"20250508 7\\\",\\\"20250507 7\\\",\\\"20250506 7\\\",\\\"20250505 7\\\",\\\"20250504 7\\\",\\\"20250503 7\\\","
            + "\\\"20250502 7\\\",\\\"20250501 7\\\",\\\"20250430 7\\\",\\\"20250429 7\\\",\\\"20250428 7\\\",\\\"20250427 7\\\",\\\"20250426 7\\\",\\\"20250425 7\\\",\\\"20250424 7\\\","
            + "\\\"20250423 7\\\",\\\"20250422 6.9\\\",\\\"20250421 6.9\\\",\\\"20250420 6.9\\\",\\\"20250419 6.9\\\",\\\"20250418 6.9\\\",\\\"20250417 6.9\\\",\\\"20250416 6.9\\\",\\\"20250415 6"
            + ".9\\\",\\\"20250414 6.9\\\",\\\"20250413 6.9\\\",\\\"20250412 6.9\\\",\\\"20250411 6.9\\\",\\\"20250409 6.8\\\",\\\"20250408 6.8\\\",\\\"20250407 6.8\\\",\\\"20250406 6.8\\\","
            + "\\\"20250405 6.8\\\",\\\"20250403 6.8\\\",\\\"20250402 6.8\\\",\\\"20250401 6.8\\\",\\\"20250516 3.6\\\",\\\"20250515 3.6\\\",\\\"20250514 4\\\",\\\"20250513 4\\\",\\\"20250512 "
            + "4\\\",\\\"20250511 4\\\",\\\"20250510 4\\\",\\\"20250509 4\\\",\\\"20250508 4\\\",\\\"20250507 4\\\",\\\"20250506 4\\\",\\\"20250505 4\\\",\\\"20250504 4\\\",\\\"20250503 4\\\","
            + "\\\"20250502 4\\\",\\\"20250501 4\\\",\\\"20250430 4\\\",\\\"20250429 4\\\",\\\"20250428 4\\\",\\\"20250427 4\\\",\\\"20250426 4\\\",\\\"20250425 4\\\",\\\"20250424 4\\\","
            + "\\\"20250423 4\\\",\\\"20250422 4\\\",\\\"20250421 4\\\",\\\"20250420 4\\\",\\\"20250419 4\\\",\\\"20250418 4\\\",\\\"20250417 4\\\",\\\"20250416 4\\\",\\\"20250415 4\\\","
            + "\\\"20250414 4\\\",\\\"20250413 4\\\",\\\"20250412 4\\\",\\\"20250411 4\\\",\\\"20250409 4\\\",\\\"20250408 4\\\",\\\"20250407 4\\\",\\\"20250405 4\\\",\\\"20250403 4\\\","
            + "\\\"20250402 4\\\",\\\"20250401 4\\\",\\\"20250518 9.3\\\",\\\"20250517 9.3\\\",\\\"20250516 9.3\\\",\\\"20250515 9.3\\\",\\\"20250514 9.3\\\",\\\"20250513 9.3\\\",\\\"20250512 9"
            + ".3\\\",\\\"20250511 9.3\\\",\\\"20250510 9.3\\\",\\\"20250509 9.3\\\",\\\"20250508 9.3\\\",\\\"20250507 9.3\\\",\\\"20250506 9.3\\\",\\\"20250505 9.3\\\",\\\"20250504 9.3\\\","
            + "\\\"20250503 9.3\\\",\\\"20250502 9.3\\\",\\\"20250501 9.3\\\",\\\"20250430 9.3\\\",\\\"20250429 9.3\\\",\\\"20250428 9.3\\\",\\\"20250427 9.3\\\",\\\"20250426 9.3\\\",\\\"20250425 9"
            + ".3\\\",\\\"20250424 9.3\\\",\\\"20250423 9.3\\\",\\\"20250422 9.3\\\",\\\"20250421 9.3\\\",\\\"20250420 9.3\\\",\\\"20250419 9.3\\\",\\\"20250418 9.3\\\",\\\"20250417 9.3\\\","
            + "\\\"20250416 9.3\\\",\\\"20250415 9.3\\\",\\\"20250414 9.3\\\",\\\"20250413 9.3\\\",\\\"20250412 9.3\\\",\\\"20250411 9.3\\\",\\\"20250409 9.3\\\",\\\"20250408 9.3\\\",\\\"20250407 9"
            + ".3\\\",\\\"20250406 9.3\\\",\\\"20250405 9.3\\\",\\\"20250404 9.3\\\",\\\"20250403 9.3\\\",\\\"20250402 9.3\\\",\\\"20250401 9.3\\\",\\\"20250518 4\\\",\\\"20250513 4\\\","
            + "\\\"20250507 4\\\",\\\"20250506 4\\\",\\\"20250505 4\\\",\\\"20250501 4\\\",\\\"20250429 4\\\",\\\"20250428 4\\\",\\\"20250427 4\\\",\\\"20250425 4\\\",\\\"20250423 4\\\","
            + "\\\"20250421 4\\\",\\\"20250417 4\\\",\\\"20250414 4\\\",\\\"20250408 4\\\",\\\"20250402 4\\\"]</data></item>";

        System.out.println(xml.replaceAll("<data>.*?</data>", ""));


    }

    /**
     * 自定义操作符的使用
     *
     * @param runner
     */
    private static void customOperatorStatement(ExpressRunner runner) throws Exception {
        class JoinOperator extends Operator {

            public Object executeInner(Object[] list) throws Exception {
                Object opdata1 = list[0];
                Object opdata2 = list[1];
                if (opdata1 instanceof java.util.List) {
                    ((java.util.List) opdata1).add(opdata2);
                    return opdata1;
                } else {
                    java.util.List result = new java.util.ArrayList();
                    result.add(opdata1);
                    result.add(opdata2);
                    return result;
                }
            }
        }

        // 返回结果  [1, 2, 3]
        //(1)addOperator
        DefaultContext<String, Object> context = new DefaultContext<String, Object>();
        runner.addOperator("join", new JoinOperator());
        Object r = runner.execute("1 join 2 join 3", context, null, false, false);
        System.out.println(r);

        // (2) addFunction
        // 返回结果：[1 , 2 ]
        runner.addFunction("joinfunc", new JoinOperator());
        r = runner.execute("joinfunc(1,2,3)", context, null, false, false);
        System.out.println(r);

        //(3)replaceOperator
        // 返回结果  [1, 2, 3]
        runner.replaceOperator("+", new JoinOperator());
        r = runner.execute("1 + 2 + 3", context, null, false, false);
        System.out.println(r);


    }

    /**
     * 操作符处理，一般不太常用，但可以自定义一些操作符
     *
     * @param runner
     */
    private static void extendOperatorStatement(ExpressRunner runner) throws Exception {
        runner.addOperatorWithAlias("如果", "if", null);
        runner.addOperatorWithAlias("则", "then", null);
        runner.addOperatorWithAlias("否则", "else", null);

        IExpressContext<String, Object> context = new DefaultContext<String, Object>();
        context.put("语文", 88);
        context.put("数学", 99);
        context.put("英语", 95);

        String exp = "如果  (语文+数学+英语>270) 则 {return 1;} 否则 {return 0;}";
//        DefaultContext<String, Object> context = new DefaultContext<String, Object>();
        Object result = runner.execute(exp, context, null, false, false, null);
        System.out.println(result);
    }

    /**
     * 将Java中已经写好的一些方法，绑定到我们自定义的变量上，在业务中最常用的部分。
     *
     * @param runner
     */
    private static void workWithJavaStatement(ExpressRunner runner) throws Exception {
        // 在使用的时候会创建对象
        runner.addFunctionOfClassMethod("取绝对值", Math.class.getName(), "abs",
            new String[]{"double"}, null);

        // 对象已经存在，直接调用对象中的方法
        runner.addFunctionOfServiceMethod("打印", System.out, "println", new String[]{"String"}, null);

        String exp = "a=取绝对值(-100);打印(\"Hello World\");打印(a.toString())";
        DefaultContext<String, Object> context = new DefaultContext<>();
        runner.execute(exp, context, null, false, false);
        System.out.println(context);
    }

    /**
     * Macro定义, 即预先定义一些内容，在使用的时候直接替换Macro中的变量为上下文的内容
     *
     * @param runner
     */
    private static void macronStatement(ExpressRunner runner) throws Exception {
        runner.addMacro("计算平均成绩", "(语文+数学+英语)/3.0");
        runner.addMacro("是否优秀", "计算平均成绩>90");

        IExpressContext<String, Object> context = new DefaultContext<String, Object>();
        context.put("语文", 88);
        context.put("数学", 99);
        context.put("英语", 95);
        Object result = runner.execute("是否优秀", context, null, false, false);
        System.out.println(result);
    }

    /**
     * 自定义在QLexpress中的函数 一般语句的最后一句话是返回结果
     *
     * @param runner
     */
    private static void functionStatement(ExpressRunner runner) throws Exception {
        String functionStatement = "function add(int a,int b){\n" +
            "  return a+b;\n" +
            "};\n" +
            "\n" +
            "function sub(int a,int b){\n" +
            "  return a - b;\n" +
            "};\n" +
            "\n" +
            "a=10;\n" +
            "add(a,4) + sub(a,9);";

        Object result = runner.execute(functionStatement, new DefaultContext<>(), null, false, false);
//        runner.execute(functionStatement, new DefaultContext<>(), null, true, false, 1000);
        System.out.println(result);
    }

    /**
     * 对Java对象的操作 系统自动会import java.lang.*,import java.util.*;
     *
     * @param runner
     */
    private static void objectStatement(ExpressRunner runner) throws Exception {
//        TradeEvent tradeEvent = new TradeEvent();
//        tradeEvent.setPrice(20.0);
//        tradeEvent.setName("购物");
//        tradeEvent.setId(UUID.randomUUID().toString());//
//
        String objectStatement = "import me.aihe.demo.trade.TradeEvent;\n" +
            "        tradeEvent = new TradeEvent();\n" +
            "        tradeEvent.setPrice(20.0);\n" +
            "        tradeEvent.id=UUID.randomUUID().toString();\n" +
            "        System.out.println(tradeEvent.getId());\n" +
            "        System.out.println(tradeEvent.price);";
        runner.execute(objectStatement, new DefaultContext<>(), null, false, false);

    }

    /**
     * 在定义集合，数组相关的操作，ql有自己的语法，不能简单的使用Java语法 //java语法：使用泛型来提醒开发者检查类型 keys = new ArrayList<String>(); deviceName2Value = new HashMap<String,String>(7); String[] deviceNames =
     * {"ng","si","umid","ut","mac","imsi","imei"}; int[] mins = {5,30};
     * <p>
     * //ql写法： keys = new ArrayList(); deviceName2Value = new HashMap(); deviceNames = ["ng","si","umid","ut","mac","imsi","imei"]; mins = [5,30];
     * <p>
     * <p>
     * //java语法：对象类型声明 FocFulfillDecisionReqDTO reqDTO = param.getReqDTO(); //ql写法： reqDTO = param.getReqDTO();
     * <p>
     * //java语法：数组遍历 for(GRCRouteLineResultDTO item : list) { } //ql写法： for(i=0;i<list.size();i++){ item = list.get(i); }
     * <p>
     * //java语法：map遍历 for(String key : map.keySet()) { System.out.println(map.get(key)); } //ql写法： keySet = map.keySet(); objArr = keySet.toArray(); for (i=0;i<objArr.length;i++) { key = objArr[i];
     * System.out.println(map.get(key)); }
     *
     * @param runner
     */
    private static void collectionStatement(ExpressRunner runner) throws Exception {
        DefaultContext<String, Object> defaultContext = new DefaultContext<>();
        HashMap<String, String> mapData = new HashMap() {{
            put("a", "hello");
            put("b", "world");
            put("c", "!@#$");
        }};
        defaultContext.put("map", mapData);
        //ql不支持for(obj:list){}的语法，只能通过下标访问。
        String mapTraverseStatement = " keySet = map.keySet();\n" +
            "  objArr = keySet.toArray();\n" +
            "  for (i=0;i<objArr.length;i++) {\n" +
            "  key = objArr[i];\n" +
            "   System.out.println(map.get(key));\n" +
            "  }";
        runner.execute(mapTraverseStatement, defaultContext, null, false, false);
        System.out.println(defaultContext);

        // 集合的快捷写法
        /**
         *       ExpressRunner runner = new ExpressRunner(false,false);
         *         DefaultContext<String, Object> context = new DefaultContext<String, Object>();
         *         String express = "abc = NewMap(1:1,2:2); return abc.get(1) + abc.get(2);";
         *         Object r = runner.execute(express, context, null, false, false);
         *         System.out.println(r);
         *         express = "abc = NewList(1,2,3); return abc.get(1)+abc.get(2)";
         *         r = runner.execute(express, context, null, false, false);
         *         System.out.println(r);
         *         express = "abc = [1,2,3]; return abc[1]+abc[2];";
         *         r = runner.execute(express, context, null, false, false);
         *         System.out.println(r);
         */

    }

    /**
     * 语法基本说明： 不支持try{}catch{} 不支持java8的lambda表达式 不支持for循环集合操作for (GRCRouteLineResultDTO item : list) 弱类型语言，请不要定义类型声明 不要用Templete（Map<String,List>之类的） array的声明不一样 min,max,round,print,println,like,in
     * 都是系统默认函数的关键字，请不要作为变量名
     *
     * @param runner
     */
    private static void basicStatement(ExpressRunner runner) throws Exception {
        DefaultContext<String, Object> defaultContext = new DefaultContext<>();

//        defaultContext.put("n",10);  //直接从Java中传递上下文等于在表达式中传递上下文
        String loopStatement = "sum=0;n=10;" +
            "for(i=0;i<n;i++){\n" +
            "sum=sum+i;\n" +
            "}\n" +
            "return sum;";
        Object result = runner.execute(loopStatement, defaultContext, null, false, false);
        System.out.println(result);

        // 注意使用同一个defaultContext，上一步语句执行的中间变量会被传递到下一个语句中
        String maxmiumStatement = "a=1;\n" +
            "b=2;\n" +
            "maxnum = a>b?a:b;";
        result = runner.execute(maxmiumStatement, defaultContext, null, false, false);
        System.out.println(result);

    }

    // 入门展示express使用部分
    private static void getStarted(ExpressRunner runner) throws Exception {
        DefaultContext<String, Object> context = new DefaultContext<String, Object>();
        context.put("a", 1);
        context.put("b", 2);
        context.put("c", 3);
        String express = "a+b*c";
        Object r = runner.execute(express, context, null, true, true);
        System.out.println(r);
    }
}
